<span style="color:orange; font-size:20px;">1. df.head() - Return the first n rows.</span>

In [6]:
import pandas as pd

# Sample dataset
data = {
    "Name": ["John", "Jai", "Kutty", "Praveen", "Appu"],
    "Age": [24, 30, 22, 35, 28],
    "Salary": [50000, 60000, 55000, 70000, 65000]
}

df = pd.DataFrame(data)
df.head()

      Name  Age  Salary
0     John   24   50000
1      Jai   30   60000
2    Kutty   22   55000
3  Praveen   35   70000
4     Appu   28   65000

<span style="color:orange; font-size:20px;">2. df.tail() - Return the last n rows.</span>

In [8]:
df = pd.DataFrame(data)
df.tail()

      Name  Age  Salary
0     John   24   50000
1      Jai   30   60000
2    Kutty   22   55000
3  Praveen   35   70000
4     Appu   28   65000

<span style="color:orange; font-size:20px;">3. df.info() - Concise summary of a DataFrame.</span>

In [9]:
df=pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

<span style="color:orange; font-size:20px;">4. df.describe() - Generate descriptive statistics.</span>

In [10]:
df=pd.DataFrame(data)
df.describe()

             Age       Salary
count   5.000000      5.00000
mean   27.800000  60000.00000
std     5.118594   7905.69415
min    22.000000  50000.00000
25%    24.000000  55000.00000
50%    28.000000  60000.00000
75%    30.000000  65000.00000
max    35.000000  70000.00000

<span style="color:orange; font-size:20px;"> 5. df.shape - Return a tuple representing the dimensionality of the DataFrame.</span>

In [12]:
df=pd.DataFrame(data)
df.shape

(5, 3)

<span style="color:orange; font-size:20px;">6.df.columns - Return the column labels of the DataFrame.</span>

In [13]:
df=pd.DataFrame(data)
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

<span style="color:orange; font-size:20px;">7. df.index - Return the index (row labels) of the DataFrame.</span>

In [14]:
df=pd.DataFrame(data)
df.index

RangeIndex(start=0, stop=5, step=1)

<span style="color:orange; font-size:20px;">8. df.dtypes - Return the data types of the columns.</span>

In [15]:
df=pd.DataFrame(data)
df.dtypes

Name      object
Age        int64
Salary     int64
dtype: object